Autodesk.Revit.DB.Structure.AnalyticalFixityState
Specifies the fixity setting of individual degrees of freedom in analytical release conditions.

Autodesk.Revit.DB.Structure.AnalyticalFixityState.Spring
Degree of freedom has a Spring coefficient.

Autodesk.Revit.DB.Structure.AnalyticalFixityState.Released
Degree of freedom is Released.

Autodesk.Revit.DB.Structure.AnalyticalFixityState.Fixed
Degree of freedom is Fixed.